{"cells":[{"cell_type":"markdown","id":"fb5785f7","metadata":{"id":"fb5785f7"},"source":["Neo4j 지식 그래프를 기반으로, 사용자의 자연어 질문에 대해 정확하고 풍부한 답변을 제공하는 GraphRAG 시스템을 구현합니다.\n","\n","단순한 키워드 매칭이나 벡터 검색의 한계를 넘어, 그래프의 구조적 정보(관계)와 벡터의 의미적 정보(유사도)를 결합하여 최적의 검색 결과를 도출합니다.\n","\n","\n","시스템은 질문의 유형에 따라 세 가지 검색 전략을 통합하여 사용합니다:\n","\n","1. **[Vector]** Content 노드 기반 벡터 검색 - 내용 유사도 기반 검색\n","2. **[VectorCypher]** - 복합 검색\n","\n","3. **[Text2Cypher]** 자연어를 Cypher로 변환한 구조적 검색\n"]},{"cell_type":"code","source":["!pip install langchain langchain-community langchain-openai neo4j python-dotenv tiktoken neo4j_graphrag"],"metadata":{"collapsed":true,"colab":{"base_uri":"https://localhost:8080/"},"id":"wy0GIFOxBODF","executionInfo":{"status":"ok","timestamp":1766020520663,"user_tz":-540,"elapsed":5239,"user":{"displayName":"주원교","userId":"05649105502918603478"}},"outputId":"c9569ab2-5de2-41a9-e5dc-2d2b333a69f2"},"id":"wy0GIFOxBODF","execution_count":2,"outputs":[{"output_type":"stream","name":"stdout","text":["Requirement already satisfied: langchain in /usr/local/lib/python3.12/dist-packages (1.1.3)\n","Requirement already satisfied: langchain-community in /usr/local/lib/python3.12/dist-packages (0.4.1)\n","Requirement already satisfied: langchain-openai in /usr/local/lib/python3.12/dist-packages (1.1.5)\n","Requirement already satisfied: neo4j in /usr/local/lib/python3.12/dist-packages (5.28.2)\n","Requirement already satisfied: python-dotenv in /usr/local/lib/python3.12/dist-packages (1.2.1)\n","Requirement already satisfied: tiktoken in /usr/local/lib/python3.12/dist-packages (0.12.0)\n","Requirement already satisfied: neo4j_graphrag in /usr/local/lib/python3.12/dist-packages (1.11.0)\n","Requirement already satisfied: langchain-core<2.0.0,>=1.1.2 in /usr/local/lib/python3.12/dist-packages (from langchain) (1.2.2)\n","Requirement already satisfied: langgraph<1.1.0,>=1.0.2 in /usr/local/lib/python3.12/dist-packages (from langchain) (1.0.4)\n","Requirement already satisfied: pydantic<3.0.0,>=2.7.4 in /usr/local/lib/python3.12/dist-packages (from langchain) (2.12.3)\n","Requirement already satisfied: langchain-classic<2.0.0,>=1.0.0 in /usr/local/lib/python3.12/dist-packages (from langchain-community) (1.0.0)\n","Requirement already satisfied: SQLAlchemy<3.0.0,>=1.4.0 in /usr/local/lib/python3.12/dist-packages (from langchain-community) (2.0.44)\n","Requirement already satisfied: requests<3.0.0,>=2.32.5 in /usr/local/lib/python3.12/dist-packages (from langchain-community) (2.32.5)\n","Requirement already satisfied: PyYAML<7.0.0,>=5.3.0 in /usr/local/lib/python3.12/dist-packages (from langchain-community) (6.0.3)\n","Requirement already satisfied: aiohttp<4.0.0,>=3.8.3 in /usr/local/lib/python3.12/dist-packages (from langchain-community) (3.13.2)\n","Requirement already satisfied: tenacity!=8.4.0,<10.0.0,>=8.1.0 in /usr/local/lib/python3.12/dist-packages (from langchain-community) (9.1.2)\n","Requirement already satisfied: dataclasses-json<0.7.0,>=0.6.7 in /usr/local/lib/python3.12/dist-packages (from langchain-community) (0.6.7)\n","Requirement already satisfied: pydantic-settings<3.0.0,>=2.10.1 in /usr/local/lib/python3.12/dist-packages (from langchain-community) (2.12.0)\n","Requirement already satisfied: langsmith<1.0.0,>=0.1.125 in /usr/local/lib/python3.12/dist-packages (from langchain-community) (0.4.56)\n","Requirement already satisfied: httpx-sse<1.0.0,>=0.4.0 in /usr/local/lib/python3.12/dist-packages (from langchain-community) (0.4.3)\n","Requirement already satisfied: numpy>=1.26.2 in /usr/local/lib/python3.12/dist-packages (from langchain-community) (2.0.2)\n","Requirement already satisfied: openai<3.0.0,>=1.109.1 in /usr/local/lib/python3.12/dist-packages (from langchain-openai) (2.9.0)\n","Requirement already satisfied: pytz in /usr/local/lib/python3.12/dist-packages (from neo4j) (2025.2)\n","Requirement already satisfied: regex>=2022.1.18 in /usr/local/lib/python3.12/dist-packages (from tiktoken) (2025.11.3)\n","Requirement already satisfied: fsspec<2025.0.0,>=2024.9.0 in /usr/local/lib/python3.12/dist-packages (from neo4j_graphrag) (2024.12.0)\n","Requirement already satisfied: json-repair<0.45.0,>=0.44.1 in /usr/local/lib/python3.12/dist-packages (from neo4j_graphrag) (0.44.1)\n","Requirement already satisfied: pypdf<7.0.0,>=6.0.0 in /usr/local/lib/python3.12/dist-packages (from neo4j_graphrag) (6.4.2)\n","Requirement already satisfied: scipy<2.0.0,>=1.13.0 in /usr/local/lib/python3.12/dist-packages (from neo4j_graphrag) (1.16.3)\n","Requirement already satisfied: types-pyyaml<7.0.0.0,>=6.0.12.20240917 in /usr/local/lib/python3.12/dist-packages (from neo4j_graphrag) (6.0.12.20250915)\n","Requirement already satisfied: aiohappyeyeballs>=2.5.0 in /usr/local/lib/python3.12/dist-packages (from aiohttp<4.0.0,>=3.8.3->langchain-community) (2.6.1)\n","Requirement already satisfied: aiosignal>=1.4.0 in /usr/local/lib/python3.12/dist-packages (from aiohttp<4.0.0,>=3.8.3->langchain-community) (1.4.0)\n","Requirement already satisfied: attrs>=17.3.0 in /usr/local/lib/python3.12/dist-packages (from aiohttp<4.0.0,>=3.8.3->langchain-community) (25.4.0)\n","Requirement already satisfied: frozenlist>=1.1.1 in /usr/local/lib/python3.12/dist-packages (from aiohttp<4.0.0,>=3.8.3->langchain-community) (1.8.0)\n","Requirement already satisfied: multidict<7.0,>=4.5 in /usr/local/lib/python3.12/dist-packages (from aiohttp<4.0.0,>=3.8.3->langchain-community) (6.7.0)\n","Requirement already satisfied: propcache>=0.2.0 in /usr/local/lib/python3.12/dist-packages (from aiohttp<4.0.0,>=3.8.3->langchain-community) (0.4.1)\n","Requirement already satisfied: yarl<2.0,>=1.17.0 in /usr/local/lib/python3.12/dist-packages (from aiohttp<4.0.0,>=3.8.3->langchain-community) (1.22.0)\n","Requirement already satisfied: marshmallow<4.0.0,>=3.18.0 in /usr/local/lib/python3.12/dist-packages (from dataclasses-json<0.7.0,>=0.6.7->langchain-community) (3.26.1)\n","Requirement already satisfied: typing-inspect<1,>=0.4.0 in /usr/local/lib/python3.12/dist-packages (from dataclasses-json<0.7.0,>=0.6.7->langchain-community) (0.9.0)\n","Requirement already satisfied: langchain-text-splitters<2.0.0,>=1.0.0 in /usr/local/lib/python3.12/dist-packages (from langchain-classic<2.0.0,>=1.0.0->langchain-community) (1.1.0)\n","Requirement already satisfied: jsonpatch<2.0.0,>=1.33.0 in /usr/local/lib/python3.12/dist-packages (from langchain-core<2.0.0,>=1.1.2->langchain) (1.33)\n","Requirement already satisfied: packaging<26.0.0,>=23.2.0 in /usr/local/lib/python3.12/dist-packages (from langchain-core<2.0.0,>=1.1.2->langchain) (25.0)\n","Requirement already satisfied: typing-extensions<5.0.0,>=4.7.0 in /usr/local/lib/python3.12/dist-packages (from langchain-core<2.0.0,>=1.1.2->langchain) (4.15.0)\n","Requirement already satisfied: uuid-utils<1.0,>=0.12.0 in /usr/local/lib/python3.12/dist-packages (from langchain-core<2.0.0,>=1.1.2->langchain) (0.12.0)\n","Requirement already satisfied: langgraph-checkpoint<4.0.0,>=2.1.0 in /usr/local/lib/python3.12/dist-packages (from langgraph<1.1.0,>=1.0.2->langchain) (3.0.1)\n","Requirement already satisfied: langgraph-prebuilt<1.1.0,>=1.0.2 in /usr/local/lib/python3.12/dist-packages (from langgraph<1.1.0,>=1.0.2->langchain) (1.0.5)\n","Requirement already satisfied: langgraph-sdk<0.3.0,>=0.2.2 in /usr/local/lib/python3.12/dist-packages (from langgraph<1.1.0,>=1.0.2->langchain) (0.2.15)\n","Requirement already satisfied: xxhash>=3.5.0 in /usr/local/lib/python3.12/dist-packages (from langgraph<1.1.0,>=1.0.2->langchain) (3.6.0)\n","Requirement already satisfied: httpx<1,>=0.23.0 in /usr/local/lib/python3.12/dist-packages (from langsmith<1.0.0,>=0.1.125->langchain-community) (0.28.1)\n","Requirement already satisfied: orjson>=3.9.14 in /usr/local/lib/python3.12/dist-packages (from langsmith<1.0.0,>=0.1.125->langchain-community) (3.11.5)\n","Requirement already satisfied: requests-toolbelt>=1.0.0 in /usr/local/lib/python3.12/dist-packages (from langsmith<1.0.0,>=0.1.125->langchain-community) (1.0.0)\n","Requirement already satisfied: zstandard>=0.23.0 in /usr/local/lib/python3.12/dist-packages (from langsmith<1.0.0,>=0.1.125->langchain-community) (0.25.0)\n","Requirement already satisfied: anyio<5,>=3.5.0 in /usr/local/lib/python3.12/dist-packages (from openai<3.0.0,>=1.109.1->langchain-openai) (4.12.0)\n","Requirement already satisfied: distro<2,>=1.7.0 in /usr/local/lib/python3.12/dist-packages (from openai<3.0.0,>=1.109.1->langchain-openai) (1.9.0)\n","Requirement already satisfied: jiter<1,>=0.10.0 in /usr/local/lib/python3.12/dist-packages (from openai<3.0.0,>=1.109.1->langchain-openai) (0.12.0)\n","Requirement already satisfied: sniffio in /usr/local/lib/python3.12/dist-packages (from openai<3.0.0,>=1.109.1->langchain-openai) (1.3.1)\n","Requirement already satisfied: tqdm>4 in /usr/local/lib/python3.12/dist-packages (from openai<3.0.0,>=1.109.1->langchain-openai) (4.67.1)\n","Requirement already satisfied: annotated-types>=0.6.0 in /usr/local/lib/python3.12/dist-packages (from pydantic<3.0.0,>=2.7.4->langchain) (0.7.0)\n","Requirement already satisfied: pydantic-core==2.41.4 in /usr/local/lib/python3.12/dist-packages (from pydantic<3.0.0,>=2.7.4->langchain) (2.41.4)\n","Requirement already satisfied: typing-inspection>=0.4.2 in /usr/local/lib/python3.12/dist-packages (from pydantic<3.0.0,>=2.7.4->langchain) (0.4.2)\n","Requirement already satisfied: charset_normalizer<4,>=2 in /usr/local/lib/python3.12/dist-packages (from requests<3.0.0,>=2.32.5->langchain-community) (3.4.4)\n","Requirement already satisfied: idna<4,>=2.5 in /usr/local/lib/python3.12/dist-packages (from requests<3.0.0,>=2.32.5->langchain-community) (3.11)\n","Requirement already satisfied: urllib3<3,>=1.21.1 in /usr/local/lib/python3.12/dist-packages (from requests<3.0.0,>=2.32.5->langchain-community) (2.5.0)\n","Requirement already satisfied: certifi>=2017.4.17 in /usr/local/lib/python3.12/dist-packages (from requests<3.0.0,>=2.32.5->langchain-community) (2025.11.12)\n","Requirement already satisfied: greenlet>=1 in /usr/local/lib/python3.12/dist-packages (from SQLAlchemy<3.0.0,>=1.4.0->langchain-community) (3.3.0)\n","Requirement already satisfied: httpcore==1.* in /usr/local/lib/python3.12/dist-packages (from httpx<1,>=0.23.0->langsmith<1.0.0,>=0.1.125->langchain-community) (1.0.9)\n","Requirement already satisfied: h11>=0.16 in /usr/local/lib/python3.12/dist-packages (from httpcore==1.*->httpx<1,>=0.23.0->langsmith<1.0.0,>=0.1.125->langchain-community) (0.16.0)\n","Requirement already satisfied: jsonpointer>=1.9 in /usr/local/lib/python3.12/dist-packages (from jsonpatch<2.0.0,>=1.33.0->langchain-core<2.0.0,>=1.1.2->langchain) (3.0.0)\n","Requirement already satisfied: ormsgpack>=1.12.0 in /usr/local/lib/python3.12/dist-packages (from langgraph-checkpoint<4.0.0,>=2.1.0->langgraph<1.1.0,>=1.0.2->langchain) (1.12.0)\n","Requirement already satisfied: mypy-extensions>=0.3.0 in /usr/local/lib/python3.12/dist-packages (from typing-inspect<1,>=0.4.0->dataclasses-json<0.7.0,>=0.6.7->langchain-community) (1.1.0)\n"]}]},{"cell_type":"code","execution_count":3,"id":"e14fd404","metadata":{"id":"e14fd404","executionInfo":{"status":"ok","timestamp":1766020536590,"user_tz":-540,"elapsed":894,"user":{"displayName":"주원교","userId":"05649105502918603478"}}},"outputs":[],"source":["from neo4j import GraphDatabase, basic_auth\n","NEO4J_URI = \"neo4j+s://579bb57f.databases.neo4j.io\"\n","NEO4J_USER = \"neo4j\"\n","NEO4J_PW   = os.getenv(\"NEO4J_PW\")\n","\n","driver = GraphDatabase.driver(\n","    NEO4J_URI,\n","    auth=basic_auth(NEO4J_USER, NEO4J_PW)\n",")"]},{"cell_type":"code","execution_count":4,"id":"cc994478","metadata":{"colab":{"base_uri":"https://localhost:8080/","height":486,"referenced_widgets":["5f36978f60fd4a11af083029b438439d","3703af04824645b885fa4b8fb07cd5ef","db7d1934913c47a69b3846c42ecd2bec","8a2894b43ffe4f0d8000fe905eaeb80a","f8acc84adc87411db36a1ad14c84f0c8","605f9520ee764029b4265d0e201c1b55","499490676252433da08b3f3615419578","fa1d4e6876b74ca79ad2bbdcbf174b28","ceea89d7172a42289ffcc7f994612e08","bb1da623458b42d29ff61f0be8ca0700","27f20ec69af842308cfdf6f559af69aa","94ed3f5e3e144f99964de43f263a41f1","c70cabcac5f643d48361a2730bae0e45","1b76780897d94b77b11cab65a5e4ab92","6a11735d059b4db4935a53dae40cd1a8","1dad425f850448f6a1f7ba07ad808887","7b7639b5527f4e99b6407dd03905202c","68ff7c45d0f04256a4ac2c17203f54ad","e7f86afdd78b44a98eb2b82fc506a1b4","6f0b0b9997054950840993dd67a61c27","7a40b2c2d15042f6ae522c4947b0abe8","597c6fe4db4e4110906a3deb3a62449a","146d5011222e47feae249c2f2291f187","9167d2253aff4bdfbbb31dbcc3a27aac","b6889da61ea344e393a925e5def12a3c","8d7160f4c2ce48789f63b6aea0df3467","f30e95beb9d242c1bad10b86a8820de4","c2bae80008094e39b62d067a652b4230","d3573ade69144bedbc335dc43152ebb5","8cccb1274e254503b42345cb4d9fffc6","c56125f96cef4d7999945cc4f9eea923","d85ec643b05248e8b575e3a9e796a0e5","618fe941862f4d7f8dabc689d5f4e542","dc17732ccf734fdfa91fecd1fb078c2f","f5174394e12b425e8aded06672996c9a","c883d72632854a2a920b946cfe57442c","8e4d0cd6e36d422d8260fa44d5f903f2","1c2dd515f99f4ff89d8543c970962e36","2d87bb6f62454771a2ef139345ce978d","7af8cc04f37c465bad2a92dc2aa58cad","8dcd46c3879847529ddf08334a92a1ff","ced86be77e7b42989f35a424c6a401bf","a627d75d4a3b417f9cac9344a93ab05c","3d7798a4a2864880a6f853d09526f1de","fb559477d50b4a76b3dcde635ec1f3dc","bebb28d24e3f4c3faedca7edc145231b","105bbd3a76914ab69ca5bc18b61a73ba","42bd0cc9e6004d3187ebdf3f304988d4","b2318f0e873d4f66b4837a08aa865a92","629b0c5efd87487c9fd17f80256f3348","bc9af23769f34e7485c332df09d0551b","364bd04bcf03442ab151b59deeb139bb","99dbf0246bb548c58a775f40594594f1","75d2e6d0fb5c47eb8144e2f3266da342","2fa2e08e40db4d3a9a5f7a873914c604","3d80e03fdbee48a5a76de2213b0fef0e","0230399de4ac4634add6f1ba8b6e5118","088511416e0a4735864ccdb94c4ac354","9f068b19292940f29b5fa9921beb19c9","096ad08bc2f04aa9b9013430ae16f32d","f35c2a67dbd54eebb240488d4ddfa7e6","906870f0d1534e4cb0859d6c5e5ad4d4","0322582b292b41e1b4db5d539fcc1c1f","bd73849697654e70b0ccb85ac848e014","f9beb23eff0f44ebb8dd150cc02e2481","42d7ce217c184ea69578a36ef04dc5b7","9882dbba0d2e4a8183dc47bb354af62f","69d7a44c324e4e1289ed066acd439bc4","8373870aef69464c9ff8e035b030ffb3","872f469060d0491384e22962ef8614ed","3c6db7f666164edb97d0e4a84ae8eec5","89c1623e18034a8792a19bfeeb0ff3cf","58c7dc7db0d24242b060a4e1c7ab06d8","d5d84933f4934425812276882c3cf8d1","68e74502b5444d37bd405dd33921b56a","d5dfd3cdd48b47a5b96b7657f46f1ca8","e550503253034836aa0957354f4d2424","4ed511baf0624b628404849251f356be","a6e6b8b9edc64c8f9661925267d17f08","45573b6bb38d45a993909ff5ad67ac31","b7748b8d1cc143a494327481770436ed","6b7ffc638ba04d6aa0ba9875d0e0b2a8","9d77e1bddb6d4ce3a9fccf03693a945f","970fe8833f184a85bc9fd6ce9c796931","7784174fa91149358997b2e1869e334f","30add58ee6b54185a004998b214a18e1","d6e6ba70711e4365af6795dbcc0844cf","6c3c4076bd9b443085bca09cfcd3191f","219381f0ca86477a96e8f183ed802dc9","5a54cf0954074e1f85d9a3a04b9e4dc5","a8aabb82746049248c609ad01576ab14","0640d1bebbfa4a2d9cb365c346da490c","4f20070ab82e47c6bb3b886ae263370c","16b72cebfa3348699aa683de9bfdb443","cb743d017100434bb42f0b5fd32f9cb8","03b94a03094c4f15b6145b1f928ea994","fe5313769f1d491bbd1e084caddb694c","7bb74a9a6c2742aeb0a3eddf639ad4d4","bfed9a76bd7f41548e87011165789648","9ba5c5495b874d29b31fcf2b9f8cd788","485985a2cbd745dbb9bd883cafac6584","8f66dfb2a92949b089708d8ba1d440d6","e7e26d7976ca48e7a8e1ecd5399ed6c8","7a1781f497d6443f9501bc17703106dc","86913d5f575648be85c358544520533e","9dec839c954d4738b364d9242399f7a4","14dcd6ce57a8436eb5dd1647143b1f2a","146a8d046b004f5ca6e4010f13ad3951","962fdbe04d954c17a5fa18ede3665045","ceb0d237c8b249b9a293031b9a7c86cc"]},"collapsed":true,"id":"cc994478","executionInfo":{"status":"ok","timestamp":1766020597875,"user_tz":-540,"elapsed":59386,"user":{"displayName":"주원교","userId":"05649105502918603478"}},"outputId":"92dbc3a3-eaf2-4fdc-911d-c9a7e4a6a7fe"},"outputs":[{"output_type":"stream","name":"stderr","text":["WARNING:torchao.kernel.intmm:Warning: Detected no triton, on systems without Triton certain kernels will not work\n","/usr/local/lib/python3.12/dist-packages/huggingface_hub/utils/_auth.py:94: UserWarning: \n","The secret `HF_TOKEN` does not exist in your Colab secrets.\n","To authenticate with the Hugging Face Hub, create a token in your settings tab (https://huggingface.co/settings/tokens), set it as secret in your Google Colab and restart your session.\n","You will be able to reuse this secret in all of your notebooks.\n","Please note that authentication is recommended but still optional to access public models or datasets.\n","  warnings.warn(\n"]},{"output_type":"display_data","data":{"text/plain":["modules.json:   0%|          | 0.00/229 [00:00<?, ?B/s]"],"application/vnd.jupyter.widget-view+json":{"version_major":2,"version_minor":0,"model_id":"5f36978f60fd4a11af083029b438439d"}},"metadata":{}},{"output_type":"display_data","data":{"text/plain":["config_sentence_transformers.json:   0%|          | 0.00/122 [00:00<?, ?B/s]"],"application/vnd.jupyter.widget-view+json":{"version_major":2,"version_minor":0,"model_id":"94ed3f5e3e144f99964de43f263a41f1"}},"metadata":{}},{"output_type":"display_data","data":{"text/plain":["README.md: 0.00B [00:00, ?B/s]"],"application/vnd.jupyter.widget-view+json":{"version_major":2,"version_minor":0,"model_id":"146d5011222e47feae249c2f2291f187"}},"metadata":{}},{"output_type":"display_data","data":{"text/plain":["sentence_bert_config.json:   0%|          | 0.00/53.0 [00:00<?, ?B/s]"],"application/vnd.jupyter.widget-view+json":{"version_major":2,"version_minor":0,"model_id":"dc17732ccf734fdfa91fecd1fb078c2f"}},"metadata":{}},{"output_type":"display_data","data":{"text/plain":["config.json:   0%|          | 0.00/645 [00:00<?, ?B/s]"],"application/vnd.jupyter.widget-view+json":{"version_major":2,"version_minor":0,"model_id":"fb559477d50b4a76b3dcde635ec1f3dc"}},"metadata":{}},{"output_type":"display_data","data":{"text/plain":["model.safetensors:   0%|          | 0.00/471M [00:00<?, ?B/s]"],"application/vnd.jupyter.widget-view+json":{"version_major":2,"version_minor":0,"model_id":"3d80e03fdbee48a5a76de2213b0fef0e"}},"metadata":{}},{"output_type":"display_data","data":{"text/plain":["tokenizer_config.json:   0%|          | 0.00/480 [00:00<?, ?B/s]"],"application/vnd.jupyter.widget-view+json":{"version_major":2,"version_minor":0,"model_id":"9882dbba0d2e4a8183dc47bb354af62f"}},"metadata":{}},{"output_type":"display_data","data":{"text/plain":["tokenizer.json:   0%|          | 0.00/9.08M [00:00<?, ?B/s]"],"application/vnd.jupyter.widget-view+json":{"version_major":2,"version_minor":0,"model_id":"4ed511baf0624b628404849251f356be"}},"metadata":{}},{"output_type":"display_data","data":{"text/plain":["special_tokens_map.json:   0%|          | 0.00/239 [00:00<?, ?B/s]"],"application/vnd.jupyter.widget-view+json":{"version_major":2,"version_minor":0,"model_id":"219381f0ca86477a96e8f183ed802dc9"}},"metadata":{}},{"output_type":"display_data","data":{"text/plain":["config.json:   0%|          | 0.00/190 [00:00<?, ?B/s]"],"application/vnd.jupyter.widget-view+json":{"version_major":2,"version_minor":0,"model_id":"9ba5c5495b874d29b31fcf2b9f8cd788"}},"metadata":{}}],"source":["import os\n","from neo4j import GraphDatabase\n","from sentence_transformers import SentenceTransformer\n","from neo4j_graphrag.embeddings import Embedder\n","from neo4j_graphrag.retrievers import VectorRetriever\n","from neo4j_graphrag.indexes import create_vector_index\n","\n","MODEL_NAME = \"sentence-transformers/paraphrase-multilingual-MiniLM-L12-v2\"\n","embed_model = SentenceTransformer(\"sentence-transformers/paraphrase-multilingual-MiniLM-L12-v2\")\n","EMBED_DIM = 384"]},{"cell_type":"markdown","id":"36d1abd2","metadata":{"id":"36d1abd2"},"source":["## vector"]},{"cell_type":"code","execution_count":5,"id":"b84c4a1d","metadata":{"id":"b84c4a1d","executionInfo":{"status":"ok","timestamp":1766020628375,"user_tz":-540,"elapsed":5504,"user":{"displayName":"주원교","userId":"05649105502918603478"}}},"outputs":[],"source":["class LocalEmbedder(Embedder):\n","    def __init__(self, model_name):\n","        self.model = SentenceTransformer(model_name)\n","\n","    def embed_query(self, text: str) -> list[float]:\n","        return self.model.encode(text, normalize_embeddings=True).tolist()\n","\n","    def embed_documents(self, texts: list[str]) -> list[list[float]]:\n","        return self.model.encode(texts, normalize_embeddings=True).tolist()\n","embedder = LocalEmbedder(MODEL_NAME)"]},{"cell_type":"code","execution_count":8,"id":"7ef7f2a2","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"7ef7f2a2","executionInfo":{"status":"ok","timestamp":1766021475909,"user_tz":-540,"elapsed":817776,"user":{"displayName":"주원교","userId":"05649105502918603478"}},"outputId":"c1b67347-6715-41bb-fe99-bc663134ed4d"},"outputs":[{"output_type":"stream","name":"stdout","text":["Start Embedding with model: sentence-transformers/paraphrase-multilingual-MiniLM-L12-v2...\n"]},{"output_type":"stream","name":"stderr","text":["WARNING:neo4j.notifications:Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: embedding)} {position: line: 5, column: 14, offset: 137} for query: '\\n    MATCH (c:Content)\\n    WHERE (c.text IS NOT NULL AND c.text <> \"\") \\n       OR (c.detail IS NOT NULL AND c.detail <> \"\")\\n      AND (c.embedding IS NULL OR c.embedding_model <> $model)\\n    RETURN c.content_id AS content_id, c.text AS text, c.name AS name, c.detail AS detail\\n    LIMIT $limit\\n    '\n","WARNING:neo4j.notifications:Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: embedding_model)} {position: line: 5, column: 37, offset: 160} for query: '\\n    MATCH (c:Content)\\n    WHERE (c.text IS NOT NULL AND c.text <> \"\") \\n       OR (c.detail IS NOT NULL AND c.detail <> \"\")\\n      AND (c.embedding IS NULL OR c.embedding_model <> $model)\\n    RETURN c.content_id AS content_id, c.text AS text, c.name AS name, c.detail AS detail\\n    LIMIT $limit\\n    '\n"]},{"output_type":"stream","name":"stdout","text":["[Batch 1] 100개 저장 (Total: 100)\n","[Batch 2] 100개 저장 (Total: 200)\n","[Batch 3] 100개 저장 (Total: 300)\n","[Batch 4] 100개 저장 (Total: 400)\n","[Batch 5] 100개 저장 (Total: 500)\n","[Batch 6] 100개 저장 (Total: 600)\n","[Batch 7] 100개 저장 (Total: 700)\n","[Batch 8] 100개 저장 (Total: 800)\n","[Batch 9] 100개 저장 (Total: 900)\n","[Batch 10] 100개 저장 (Total: 1000)\n","[Batch 11] 100개 저장 (Total: 1100)\n","[Batch 12] 100개 저장 (Total: 1200)\n","[Batch 13] 100개 저장 (Total: 1300)\n","[Batch 14] 100개 저장 (Total: 1400)\n","[Batch 15] 100개 저장 (Total: 1500)\n","[Batch 16] 100개 저장 (Total: 1600)\n","[Batch 17] 100개 저장 (Total: 1700)\n","[Batch 18] 100개 저장 (Total: 1800)\n","[Batch 19] 100개 저장 (Total: 1900)\n","[Batch 20] 100개 저장 (Total: 2000)\n","[Batch 21] 100개 저장 (Total: 2100)\n","[Batch 22] 100개 저장 (Total: 2200)\n","[Batch 23] 100개 저장 (Total: 2300)\n","[Batch 24] 100개 저장 (Total: 2400)\n","[Batch 25] 100개 저장 (Total: 2500)\n","[Batch 26] 100개 저장 (Total: 2600)\n","[Batch 27] 100개 저장 (Total: 2700)\n","[Batch 28] 100개 저장 (Total: 2800)\n","[Batch 29] 100개 저장 (Total: 2900)\n","[Batch 30] 100개 저장 (Total: 3000)\n","[Batch 31] 100개 저장 (Total: 3100)\n","[Batch 32] 100개 저장 (Total: 3200)\n","[Batch 33] 100개 저장 (Total: 3300)\n","[Batch 34] 100개 저장 (Total: 3400)\n","[Batch 35] 100개 저장 (Total: 3500)\n","[Batch 36] 100개 저장 (Total: 3600)\n","[Batch 37] 100개 저장 (Total: 3700)\n","[Batch 38] 100개 저장 (Total: 3800)\n","[Batch 39] 100개 저장 (Total: 3900)\n","[Batch 40] 100개 저장 (Total: 4000)\n","[Batch 41] 100개 저장 (Total: 4100)\n","[Batch 42] 100개 저장 (Total: 4200)\n","[Batch 43] 100개 저장 (Total: 4300)\n","[Batch 44] 100개 저장 (Total: 4400)\n","[Batch 45] 100개 저장 (Total: 4500)\n","[Batch 46] 100개 저장 (Total: 4600)\n","[Batch 47] 100개 저장 (Total: 4700)\n","[Batch 48] 100개 저장 (Total: 4800)\n","[Batch 49] 100개 저장 (Total: 4900)\n","[Batch 50] 100개 저장 (Total: 5000)\n","[Batch 51] 100개 저장 (Total: 5100)\n","[Batch 52] 100개 저장 (Total: 5200)\n","[Batch 53] 100개 저장 (Total: 5300)\n","[Batch 54] 100개 저장 (Total: 5400)\n","[Batch 55] 100개 저장 (Total: 5500)\n","[Batch 56] 100개 저장 (Total: 5600)\n","[Batch 57] 100개 저장 (Total: 5700)\n","[Batch 58] 100개 저장 (Total: 5800)\n","[Batch 59] 100개 저장 (Total: 5900)\n","[Batch 60] 100개 저장 (Total: 6000)\n","[Batch 61] 100개 저장 (Total: 6100)\n","[Batch 62] 100개 저장 (Total: 6200)\n","[Batch 63] 100개 저장 (Total: 6300)\n","[Batch 64] 100개 저장 (Total: 6400)\n","[Batch 65] 100개 저장 (Total: 6500)\n","[Batch 66] 100개 저장 (Total: 6600)\n","[Batch 67] 100개 저장 (Total: 6700)\n","[Batch 68] 100개 저장 (Total: 6800)\n","[Batch 69] 100개 저장 (Total: 6900)\n","[Batch 70] 100개 저장 (Total: 7000)\n","[Batch 71] 100개 저장 (Total: 7100)\n","[Batch 72] 100개 저장 (Total: 7200)\n","[Batch 73] 100개 저장 (Total: 7300)\n","[Batch 74] 100개 저장 (Total: 7400)\n","[Batch 75] 100개 저장 (Total: 7500)\n","[Batch 76] 100개 저장 (Total: 7600)\n","[Batch 77] 100개 저장 (Total: 7700)\n","[Batch 78] 100개 저장 (Total: 7800)\n","[Batch 79] 100개 저장 (Total: 7900)\n","[Batch 80] 100개 저장 (Total: 8000)\n","[Batch 81] 100개 저장 (Total: 8100)\n","[Batch 82] 100개 저장 (Total: 8200)\n","[Batch 83] 100개 저장 (Total: 8300)\n","[Batch 84] 100개 저장 (Total: 8400)\n","[Batch 85] 100개 저장 (Total: 8500)\n","[Batch 86] 100개 저장 (Total: 8600)\n","[Batch 87] 100개 저장 (Total: 8700)\n","[Batch 88] 100개 저장 (Total: 8800)\n","[Batch 89] 100개 저장 (Total: 8900)\n","[Batch 90] 100개 저장 (Total: 9000)\n","[Batch 91] 100개 저장 (Total: 9100)\n","[Batch 92] 100개 저장 (Total: 9200)\n","[Batch 93] 100개 저장 (Total: 9300)\n","[Batch 94] 100개 저장 (Total: 9400)\n","[Batch 95] 100개 저장 (Total: 9500)\n","[Batch 96] 100개 저장 (Total: 9600)\n","[Batch 97] 100개 저장 (Total: 9700)\n","[Batch 98] 100개 저장 (Total: 9800)\n","[Batch 99] 100개 저장 (Total: 9900)\n","[Batch 100] 100개 저장 (Total: 10000)\n","[OK] 인덱스(vector_index) 생성 완료\n"]}],"source":["def fetch_contents_needing_embedding(tx, limit=200):\n","    q = \"\"\"\n","    MATCH (c:Content)\n","    WHERE (c.text IS NOT NULL AND c.text <> \"\")\n","       OR (c.detail IS NOT NULL AND c.detail <> \"\")\n","      AND (c.embedding IS NULL OR c.embedding_model <> $model)\n","    RETURN c.content_id AS content_id, c.text AS text, c.name AS name, c.detail AS detail\n","    LIMIT $limit\n","    \"\"\"\n","    return list(tx.run(q, limit=limit, model=MODEL_NAME))\n","\n","def update_content_embeddings(tx, rows):\n","    q = \"\"\"\n","    UNWIND $rows AS row\n","    MATCH (c:Content {content_id: row.content_id})\n","    SET c.embedding = row.embedding,\n","        c.text = row.text,\n","        c.embedding_model = $model,\n","        c.embedding_dim = $dim\n","    \"\"\"\n","    tx.run(q, rows=rows, model=MODEL_NAME, dim=EMBED_DIM)\n","\n","def embed_all_contents(batch_size=100, max_batches=100):\n","    print(f\"Start Embedding with model: {MODEL_NAME}...\")\n","    total = 0\n","    with driver.session() as session:\n","        for i in range(max_batches):\n","            records = session.execute_read(fetch_contents_needing_embedding, batch_size)\n","            if not records:\n","                print(\"모든 데이터 임베딩 완료.\")\n","                break\n","\n","            processed_rows = []\n","            texts_to_embed = []\n","\n","            for r in records:\n","                text_content = r[\"text\"]\n","                if not text_content and r[\"detail\"]:\n","                    text_content = f\"[{r['name']}] {r['detail']}\"\n","\n","                texts_to_embed.append(text_content)\n","                processed_rows.append({\"content_id\": r[\"content_id\"], \"text\": text_content})\n","\n","            # 벡터 생성\n","            embeddings = embedder.embed_documents(texts_to_embed)\n","\n","            rows = []\n","            for row_data, vec in zip(processed_rows, embeddings):\n","                row_data[\"embedding\"] = vec\n","                rows.append(row_data)\n","\n","            session.execute_write(update_content_embeddings, rows)\n","\n","            total += len(rows)\n","            print(f\"[Batch {i+1}] {len(rows)}개 저장 (Total: {total})\")\n","\n","embed_all_contents()\n","\n","\n","### 벡터 인덱스 생성\n","VECTOR_INDEX_NAME = \"vector_index\"\n","\n","try:\n","    # 기존 인덱스가 있다면 삭제 후 재생성 (차원 충돌 방지)\n","    with driver.session() as session:\n","        session.run(f\"DROP INDEX {VECTOR_INDEX_NAME} IF EXISTS\")\n","\n","    create_vector_index(\n","        driver,\n","        VECTOR_INDEX_NAME,\n","        \"Content\",\n","        \"embedding\",\n","        EMBED_DIM,\n","        \"cosine\"\n","    )\n","    print(f\"[OK] 인덱스({VECTOR_INDEX_NAME}) 생성 완료\")\n","except Exception as e:\n","    print(f\"인덱스 오류: {e}\")\n","\n"]},{"cell_type":"code","source":["retriever = VectorRetriever(\n","        driver=driver,\n","        index_name=VECTOR_INDEX_NAME,\n","        embedder=embedder,\n","        return_properties=[\"text\", \"content_id\"]\n","    )"],"metadata":{"id":"tlbcKOoFirNl"},"id":"tlbcKOoFirNl","execution_count":null,"outputs":[]},{"cell_type":"code","execution_count":12,"id":"8d712c94","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"8d712c94","executionInfo":{"status":"ok","timestamp":1766021659931,"user_tz":-540,"elapsed":288,"user":{"displayName":"주원교","userId":"05649105502918603478"}},"outputId":"ab9f26a6-b52e-4795-de22-61e3a24e34a3"},"outputs":[{"output_type":"stream","name":"stdout","text":["질문:  kt에서 제공하는 티빙 스탠다드, MGC 커피구독을 해지하려면 결제일 기준 언제까지 해야 해?\n","\n","[Rank 1]\n","  - Score      : 0.8100\n","  - Content ID : KT_1665_policy_7\n","  - Text       :  이용료 결제일(서비스 이용기간 시작일) 기준 7일 이후에 해지하시는 경우에는, 즉시 해지 불가 및 해지 예약되고 이용요금은 해당월의 이용료가 전액 청구되며, 티빙 콘텐츠와 메가MGC커피 기프티쇼를 1달 동안 지속 이용 가능합니다. 예시) 최초 가입일이 1월 3일인 경우, 서비스 이용료 결제일은 매월 3일이며 매월 10일부터 서비스 이용료 결제일인 3일 이전까지 해지 시 '월 이용료 전액 부과'되며 익월 2일까지 티빙 콘텐츠와 메가MGC커피 기프티쇼 이용 가능 1) 부가서비스 가입 후, 매월 서비스 이용료 결제일(서비스 이용기간 시...\n","--------------------------------------------------\n","[Rank 2]\n","  - Score      : 0.8075\n","  - Content ID : KT_1579_policy_5\n","  - Text       : 련해서는 아래의 정책이 적용됩니다. 1) 부가서비스 가입 후, 매월 서비스 이용료 결제일(서비스 이용기간 시작일) 기준 7일 이내 해지하시는 경우에는, 티빙 콘텐츠와 스타벅스 기프티쇼 이용 여부에 따라 해지 처리됩니다. 가입 후 7일 이내 티빙 콘텐츠 및 스타벅스 기프티쇼 사용 이력이 없는 경우, 즉시 해지가 가능하며, 명세서에 청구되지 않습니다. 가입 후 7일 이내 티빙 콘텐츠 또는 스타벅스 기프티쇼 사용 이력이 존재하는 경우, 즉시 해지 불가 및 해지 예약되며 이용요금이 부과됩니다. 예시) 최초 가입일이 1월 3일인 경우, 서비...\n","--------------------------------------------------\n","[Rank 3]\n","  - Score      : 0.7995\n","  - Content ID : KT_1665_policy_8\n","  - Text       : 프티쇼 이용 가능 1) 부가서비스 가입 후, 매월 서비스 이용료 결제일(서비스 이용기간 시작일) 기준 7일 이내 해지하시는 경우에는, 티빙 콘텐츠와 메가MGC커피 기프티쇼 이용 여부에 따라 해지 처리됩니다. 가입 후 7일 이내 티빙 콘텐츠 및 메가MGC커피 기프티쇼 사용 이력이 없는 경우, 즉시 해지가 가능하며, 명세서에 청구되지 않습니다. 가입 후 7일 이내 티빙 콘텐츠 또는 메가MGC커피 기프티쇼 사용 이력이 존재하는 경우, 즉시 해지 불가 및 해지 예약되며 이용요금이 부과됩니다. 예시) 최초 가입일이 1월 3일인 경우, 서비스...\n","--------------------------------------------------\n"]}],"source":["def check_vector_search(query, top_k=3):\n","    print(f\"질문: {query}\\n\")\n","\n","    # 검색 수행\n","    results = retriever.search(query_text=query, top_k=top_k)\n","\n","    # 결과 출력\n","    for i, item in enumerate(results.items):\n","\n","        content = item.content\n","        score = item.metadata.get('score', 0.0)\n","\n","        if isinstance(content, str):\n","            try:\n","                import ast\n","                content = ast.literal_eval(content)\n","            except:\n","                pass\n","\n","        content_id = content.get('content_id', 'Unknown') if isinstance(content, dict) else 'Unknown'\n","        text_preview = content.get('text', '') if isinstance(content, dict) else str(content)\n","\n","        print(f\"[Rank {i+1}]\")\n","        print(f\"  - Score      : {score:.4f}\")\n","        print(f\"  - Content ID : {content_id}\")\n","        print(f\"  - Text       : {text_preview}...\")\n","        print(\"-\" * 50)\n","\n","# 3. 테스트 실행\n","check_vector_search(\" kt에서 제공하는 티빙 스탠다드, MGC 커피구독을 해지하려면 결제일 기준 언제까지 해야 해?\", top_k=3)"]},{"cell_type":"markdown","id":"699391c0","metadata":{"id":"699391c0"},"source":["### vector cypher"]},{"cell_type":"code","execution_count":15,"id":"1245c950","metadata":{"id":"1245c950","executionInfo":{"status":"ok","timestamp":1766021723105,"user_tz":-540,"elapsed":64,"user":{"displayName":"주원교","userId":"05649105502918603478"}}},"outputs":[],"source":["from neo4j_graphrag.retrievers import VectorCypherRetriever\n","\n","# [시나리오]\n","# 1. 벡터 검색(Vector Search)으로 질문과 의미가 가장 유사한 'Content(약관/정책)' 또는 'Benefit(혜택 상세)' 노드를 찾음.\n","# 2. 찾은 노드가 '약관(Policy)'이라면: 해당 약관을 보유한 'Product(상품)'를 역추적.\n","# 3. 찾은 노드가 '혜택(Benefit)'이라면: 해당 혜택을 제공하는 'Plan(요금제)'을 거쳐 상위 'Product(상품)'를 역추적.\n","# 4. 최종적으로 식별된 'Product'를 기준으로, 포함된 'Service(서비스)' 목록과 제공하는 모든 'Plan(요금제)'의 가격 정보를 함께 수집하여 반환.\n","\n","retrieval_query = \"\"\"\n","// 1. Vector 검색으로 찾은 node를 'content'라고 정의\n","WITH node AS content, score\n","\n","// 2. 이 컨텐츠가 속한 상품(Product)을 찾음 (두 가지 경로 고려)\n","// 경로 A: Product -> HAS_POLICY -> Content (약관인 경우)\n","OPTIONAL MATCH (p1:Product)-[:HAS_POLICY]->(content)\n","// 경로 B: Product -> HAS_PLAN -> Plan -> OFFERS -> Content (혜택인 경우)\n","OPTIONAL MATCH (p2:Product)-[:HAS_PLAN]->(:Plan)-[:OFFERS]->(content)\n","\n","WITH content, score, coalesce(p1, p2) AS product\n","WHERE product IS NOT NULL\n","\n","// 3. 해당 상품의 서비스와 요금제 정보 수집\n","OPTIONAL MATCH (product)-[:INCLUDES_SERVICE]->(service:Service)\n","OPTIONAL MATCH (product)-[:HAS_PLAN]->(plan:Plan)\n","\n","// 4. 결과 반환\n","RETURN\n","    content.text AS text,\n","    product.name AS product_name,\n","    product.url AS product_url,\n","    collect(DISTINCT service.name) AS included_services,\n","    collect(DISTINCT {\n","        plan_name: plan.title,\n","        price: plan.price_regular,\n","        discount_price: plan.price_kt\n","    }) AS related_plans,\n","    score\n","\"\"\"\n","\n","vector_cypher_retriever = VectorCypherRetriever(\n","    driver=driver,\n","    index_name=\"vector_index\",\n","    retrieval_query=retrieval_query,\n","    embedder=embedder\n",")"]},{"cell_type":"markdown","id":"c2fe99f5","metadata":{"id":"c2fe99f5"},"source":["##  Text2Cypher"]},{"cell_type":"code","execution_count":18,"id":"2804ff0d","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"2804ff0d","executionInfo":{"status":"ok","timestamp":1766021796411,"user_tz":-540,"elapsed":82,"user":{"displayName":"주원교","userId":"05649105502918603478"}},"outputId":"2c2f647f-33d8-4f15-adae-b8e2b788a98e"},"outputs":[{"output_type":"stream","name":"stderr","text":["WARNING:neo4j.notifications:Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Procedure.ProcedureWarning} {category: GENERIC} {title: The query used a procedure that generated a warning.} {description: The query used a procedure that generated a warning. (The field `propertyTypes` will change output format in the next major version.)} {position: line: 2, column: 13, offset: 13} for query: '\\n            CALL db.schema.nodeTypeProperties()\\n            YIELD nodeType, propertyName, propertyTypes\\n            WHERE propertyName IS NOT NULL\\n            RETURN nodeType, collect(propertyName) as properties\\n        '\n"]},{"output_type":"stream","name":"stdout","text":["=== Graph Schema ===\n","[Nodes]\n","- :`Product` ['product_id', 'name', 'url', 'fetched_at', 'promotion_info']\n","- :`Service` ['service_id', 'name', 'category']\n","- :`Plan` ['plan_id', 'title', 'price_regular', 'price_kt', 'price_promo', 'currency', 'billing_period']\n","- :`Content` ['content_id', 'name', 'detail', 'type', 'text', 'index', 'embedding', 'embedding_model', 'embedding_dim']\n","- :`BasePlan` ['key']\n","- :`Provider` ['provider_id', 'name']\n","\n","[Relationships]\n","(:Provider)-[:PROVIDES]->(:Product)\n","(:Product)-[:INCLUDES_SERVICE]->(:Service)\n","(:Product)-[:HAS_PLAN]->(:Plan)\n","(:Product)-[:HAS_POLICY]->(:Content)\n","(:Plan)-[:BASED_ON]->(:BasePlan)\n","(:Plan)-[:OFFERS]->(:Content)\n","\n"]}],"source":["from neo4j_graphrag.retrievers import Text2CypherRetriever\n","def get_schema():\n","    with driver.session() as session:\n","        node_props = session.run(\"\"\"\n","            CALL db.schema.nodeTypeProperties()\n","            YIELD nodeType, propertyName, propertyTypes\n","            WHERE propertyName IS NOT NULL\n","            RETURN nodeType, collect(propertyName) as properties\n","        \"\"\").data()\n","\n","        rels = session.run(\"\"\"\n","             MATCH (n)-[r]->(m)\n","             RETURN DISTINCT labels(n)[0] as source, type(r) as rel_type, labels(m)[0] as target\n","             LIMIT 50\n","         \"\"\").data()\n","\n","        schema_text = \"=== Graph Schema ===\\n\"\n","\n","        schema_text += \"[Nodes]\\n\"\n","        for n in node_props:\n","            schema_text += f\"- {n['nodeType']} {n['properties']}\\n\"\n","\n","        schema_text += \"\\n[Relationships]\\n\"\n","        for r in rels:\n","            schema_text += f\"(:{r['source']})-[:{r['rel_type']}]->(:{r['target']})\\n\"\n","\n","        return schema_text\n","\n","# 스키마 확인\n","neo4j_schema = get_schema()\n","print(neo4j_schema)"]},{"cell_type":"code","execution_count":41,"id":"85d18c78","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"85d18c78","executionInfo":{"status":"ok","timestamp":1766029750714,"user_tz":-540,"elapsed":1213,"user":{"displayName":"주원교","userId":"05649105502918603478"}},"outputId":"e04cafbd-5cce-4f9f-bbaa-ac5c16aba6d0"},"outputs":[{"output_type":"stream","name":"stdout","text":["Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount(\"/content/drive\", force_remount=True).\n"," LLM 설정 완료: llama-3.1-8b-instant\n"]}],"source":["import os\n","from dotenv import load_dotenv\n","from neo4j_graphrag.llm import OpenAILLM\n","\n","from google.colab import drive\n","drive.mount('/content/drive')\n","\n","env_path = '/content/drive/MyDrive/project_Demo/start_final/.env'\n","load_dotenv(env_path)\n","\n","groq_api_key = os.getenv(\"GROQ_API_KEY\")\n","\n","if not groq_api_key:\n","    raise ValueError(f\"API Key를 찾을 수 없습니다. {env_path} 파일을 확인해주세요.\")\n","\n","\n","os.environ[\"OPENAI_API_KEY\"] = groq_api_key\n","os.environ[\"OPENAI_BASE_URL\"] = \"https://api.groq.com/openai/v1\"\n","llm = OpenAILLM(\n","    model_name=\"llama-3.1-8b-instant\", #llama-3.3-70b-versatile 무료 사용량 초과로 대체 모델 사용\n","    model_params={\n","        \"temperature\": 0,\n","        \"max_tokens\": 2000\n","    }\n",")\n","\n","print(f\" LLM 설정 완료: {llm.model_name}\")"]},{"cell_type":"code","execution_count":42,"id":"24647a66","metadata":{"id":"24647a66","executionInfo":{"status":"ok","timestamp":1766029752414,"user_tz":-540,"elapsed":137,"user":{"displayName":"주원교","userId":"05649105502918603478"}}},"outputs":[],"source":["examples = [\n","    \"\"\"\n","    USER INPUT: 티빙 프리미엄 요금제 가격 알려줘\n","    CYPHER QUERY:\n","    MATCH (p:Product {name: \"TVING 이용권\"})-[:OFFERS]->(plan:Plan)\n","    WHERE plan.plan_title CONTAINS \"프리미엄\"\n","    RETURN plan.plan_title, plan.prices\n","    \"\"\",\n","\n","    \"\"\"\n","    USER INPUT: 메가커피랑 같이 주는 상품의 약관 내용을 보여줘\n","    CYPHER QUERY:\n","    MATCH (p:Product)-[:HAS_CONTENT]->(c:Content)\n","    WHERE p.name CONTAINS \"메가MGC커피\"\n","    RETURN p.name, c.text\n","    LIMIT 1\n","    \"\"\",\n","\n","    \"\"\"\n","    USER INPUT: KT 구독 상품 중에 가장 비싼 요금제는 뭐야?\n","    CYPHER QUERY:\n","    MATCH (p:Product)-[:OFFERS]->(plan:Plan)\n","    RETURN p.name, plan.plan_title, plan.prices\n","    ORDER BY plan.prices DESC\n","    LIMIT 1\n","    \"\"\",\n","\n","    \"\"\"\n","    USER INPUT: 티빙 해지할 때 위약금 관련 정책 알려줘\n","    CYPHER QUERY:\n","    MATCH (c:Content)\n","    WHERE c.text CONTAINS \"해지\" OR c.text CONTAINS \"위약금\"\n","    RETURN c.text\n","    LIMIT 3\n","    \"\"\",\n","    \"\"\"\n","    USER INPUT: 티빙 광고형 스탠다드 요금제 혜택이 뭐야?\n","    CYPHER QUERY:\n","    MATCH (plan:Plan)\n","    WHERE plan.plan_title CONTAINS '광고형 스탠다드'\n","    RETURN plan.plan_title, plan.benefits\n","    \"\"\",\n","    \"\"\"\n","    USER INPUT: 티빙 이용권 프리미엄 요금제 가격 얼마야? KT 할인가도 알려줘.\n","    CYPHER QUERY:\n","    MATCH (p:Product)-[:OFFERS]->(plan:Plan)\n","    WHERE p.name CONTAINS 'TVING' AND plan.plan_title CONTAINS '프리미엄'\n","    RETURN p.name, plan.plan_title, plan.price_regular, plan.price_kt\n","    \"\"\"\n","    \"\"\"\n","    USER INPUT: 광고형 스탠다드 요금제는 화질이 어떻게 돼? 동시 접속은 몇 명까지야?\n","    CYPHER QUERY:\n","    MATCH (plan:Plan)-[:HAS_BENEFIT]->(b:Benefit)\n","    WHERE plan.plan_title CONTAINS '광고형 스탠다드' AND b.benefit_type = 'SPEC'\n","    RETURN plan.plan_title, b.max_quality, b.concurrent_streams\n","    \"\"\",\n","    \"\"\"\n","    USER INPUT: 메가커피랑 같이 주는 상품 중에서 2만원 이하인 요금제 있어?\n","    CYPHER QUERY:\n","    MATCH (p:Product)-[:OFFERS]->(plan:Plan)\n","    WHERE p.name CONTAINS '메가MGC커피' AND plan.price_regular <= 20000\n","    RETURN p.name, plan.plan_title, plan.price_regular\n","    ORDER BY plan.price_regular ASC\n","    \"\"\",\n","    \"\"\"\n","    USER INPUT: KT 구독 상품 해지하면 환불 규정이 어떻게 돼?\n","    CYPHER QUERY:\n","    MATCH (prov:Provider {name: 'KT구독'})-[:PROVIDES]->(p:Product)-[:HAS_CONTENT]->(c:Content)\n","    WHERE c.text CONTAINS '해지' OR c.text CONTAINS '환불'\n","    RETURN p.name, c.text\n","    LIMIT 3\n","    \"\"\",\n","    \"\"\"\n","    USER INPUT: KT구독에서 제공하는 상품들은 어떤 서비스가 포함되어 있어?\n","    CYPHER QUERY:\n","    MATCH (prov:Provider {name: 'KT구독'})-[:PROVIDES]->(p:Product)-[:INCLUDES_SERVICE]->(s:Service)\n","    RETURN p.name AS Product, collect(s.name) AS Included_Services\n","    \"\"\"\n","]\n","\n","text2cypher_retriever = Text2CypherRetriever(\n","    driver=driver,\n","    llm=llm,\n","    neo4j_schema=neo4j_schema,\n","    examples=examples,\n",")"]},{"cell_type":"markdown","id":"987f1643","metadata":{"id":"987f1643"},"source":["### 3가지 Retriever(Vector, VectorCypher, Text2Cypher)를 하나로 통합하여 ToolsRetriever와 GraphRAG를 구축"]},{"cell_type":"code","execution_count":29,"id":"2301e3e7","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"2301e3e7","executionInfo":{"status":"ok","timestamp":1766022183040,"user_tz":-540,"elapsed":44,"user":{"displayName":"주원교","userId":"05649105502918603478"}},"outputId":"f1fb5264-cfaa-4cdf-9aeb-24e11c0ee977"},"outputs":[{"output_type":"stream","name":"stdout","text":["[OK] ToolsRetriever 설정 완료\n"]}],"source":["from neo4j_graphrag.retrievers import ToolsRetriever\n","from neo4j_graphrag.generation import GraphRAG, RagTemplate\n","\n","# (1) Vector Retriever Tool: 단순 의미 검색\n","# - 상황: 사용자가  정책이나 약관 내용을 찾을 때\n","vector_tool = retriever.convert_to_tool(\n","    name=\"Policy_Vector_Search\",\n","    description=\"사용자가 '해지', '환불', '유의사항' 등 약관이나 정책의 뉘앙스를 물어볼 때 사용합니다. 구체적인 수치보다는 텍스트의 의미를 찾을 때 적합합니다.\"\n",")\n","\n","# (2) VectorCypher Retriever Tool: 문맥 + 구조적 정보(상품/요금제) 결합\n","# - 상황: 약관을 물어보면서 동시에 그 약관이 적용되는 상품명이나 요금제 리스트를 같이 알아야 할 때\n","vector_cypher_tool = vector_cypher_retriever.convert_to_tool(\n","    name=\"Comprehensive_Product_Search\",\n","    description=\"사용자가 약관 내용과 함께, 해당 약관이 포함된 '상품 정보'와 '요금제 목록(가격 포함)'을 한꺼번에 알고 싶을 때 가장 유용합니다. (예: '커피 주는 요금제 설명해줘')\"\n",")\n","\n","# (3) Text2Cypher Retriever Tool: 정확한 사실/화질 등)을 콕 집어서 물어볼 때\n","text2cypher_tool = text2cypher_retriever.convert_to_tool(\n","    name=\"Factual_Data_Search\",\n","    description=\"정확한 '가격', '요금제 이름', '혜택' 등 DB에 저장된 구체적인 사실이나 수치를 검색할 때 사용합니다. (예: '프리미엄 요금제 얼마야?')\"\n",")\n","tools_retriever = ToolsRetriever(\n","    driver=driver,\n","    llm=llm,\n","    tools=[vector_tool, vector_cypher_tool, text2cypher_tool]\n",")\n","\n","print(\"[OK] ToolsRetriever 설정 완료\")"]},{"cell_type":"code","execution_count":36,"id":"faccb284","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"faccb284","executionInfo":{"status":"ok","timestamp":1766022705864,"user_tz":-540,"elapsed":30,"user":{"displayName":"주원교","userId":"05649105502918603478"}},"outputId":"309f5dc4-3cea-4611-b16c-5d48c3e5816f"},"outputs":[{"output_type":"stream","name":"stdout","text":["[OK] GraphRAG(Agent) 준비 완료\n"]}],"source":["\n","prompt_template = RagTemplate(\n","    template=\"\"\"당신은 구독 상품 정보를 제공하는 전문 상담 AI입니다.\n","\n","질문: {query_text}\n","\n","검색된 정보(Context):\n","{context}\n","\n","지침:\n","1. 제공된 검색 결과(Context)가 JSON 형식이거나 리스트일 수 있습니다. 내용을 잘 파석하여 답변하세요.\n","2. 답변에는 반드시 **상품명(Product Name)**, **관련 요금제(Plan)**, **가격(Price)** 정보를 포함하려고 노력하세요.\n","3. 약관이나 주의사항이 있다면 핵심 내용을 요약해서 전달하세요.\n","4. 검색 결과에 없는 내용은 \"죄송하지만 해당 정보는 찾을 수 없습니다\"라고 말하고 추측하지 마세요.\n","5. 금액은 '원' 단위로 명확히 표기하세요.\n","\n","답변 형식 예시:\n","- [상품명] (상품 URL)\n","  주요 요금제: [요금제 이름] - [가격]원\n","  관련 정책/내용: [내용 요약]\n","\n","답변:\"\"\",\n","    expected_inputs=[\"context\", \"query_text\"]\n",")\n","\n","# ---------------------------------------------------------\n","# 4. GraphRAG 생성\n","# ---------------------------------------------------------\n","graphrag = GraphRAG(\n","    llm=llm,\n","    retriever=tools_retriever, # 여기서 ToolsRetriever를 연결\n","    prompt_template=prompt_template\n",")\n","\n","print(\"[OK] GraphRAG(Agent) 준비 완료\")"]},{"cell_type":"code","execution_count":null,"id":"782c9ef6","metadata":{"id":"782c9ef6","outputId":"ec6381da-0463-45e3-81c5-73e0c02c2aaf"},"outputs":[{"name":"stdout","output_type":"stream","text":["💡 'exit', 'quit', 'q'를 입력하면 종료됩니다.\n","\n"," 검색 및 답변 생성 중...\n"," [질문]: \"티빙 프리미엄 가격은 얼마고 화질은 어때?\"\n","\n","==================================================\n","[답변]\n","티빙 프리미엄 (https://www.tving.com/)\n","  주요 요금제: 티빙 프리미엄 - 13,900원\n","  관련 정책/내용: 티빙 프리미엄은 다양한 콘텐츠를 고화질(1080p)로 시청할 수 있습니다.\n","==================================================\n","\n"," 검색 및 답변 생성 중...\n"," [질문]: 티빙이용권을 가입하고 나서 한 번도 안 썼는데 취소될까?\n","\n","==================================================\n","[답변]\n","- TVING+메가MGV커피 \n","  주요 요금제: 프리미엄+메가MGC커피, 스탠다드+메가MGC커피, 베이직+메가MGC커피, 광고형스탠다드+메가MGC커피 \n","  관련 정책/내용: 가입 후 7일 이내 티빙 콘텐츠 및 메가MGC커피 기프티쇼 사용 이력이 없는 경우, 즉시 해지가 가능하며, 명세서에 청구되지 않습니다. 티빙 이용권을 가입하고 나서 한 번도 안 쓴 경우, 즉시 해지가 가능하며, 명세서에 청구되지 않습니다.\n","==================================================\n","\n"," 검색 및 답변 생성 중...\n"," [질문]: 메가커피 주는 상품 해지하면 위약금 있어?\n","\n","==================================================\n","[답변]\n","- TVING+메가MGV커피 \n","  주요 요금제: 프리미엄+메가MGC커피, 스탠다드+메가MGC커피, 베이직+메가MGC커피, 광고형스탠다드+메가MGC커피 - 가격 정보는 제공된 검색 결과에 없습니다.\n","  관련 정책/내용: 부가서비스 가입 후, 매월 서비스 이용료 결제일(서비스 이용기간 시작일) 기준 7일 이내 해지 시, 티빙 콘텐츠와 메가MGC커피 기프티쇼 이용 여부에 따라 해지 처리됩니다. 가입 후 7일 이내 티빙 콘텐츠 및 메가MGC커피 기프티쇼 사용 이력이 없는 경우, 즉시 해지가 가능하며, 명세서에 청구되지 않습니다. 가입 후 7일 이후에 해지하는 경우, 즉시 해지 불가 및 해지 예약되고 이용요금은 해당월의 이용료가 전액 청구되며, 티빙 콘텐츠와 메가MGC커피 기프티쇼를 1달 동안 지속 이용 가능합니다. 위약금에 대한 정보는 제공된 검색 결과에 없습니다.\n","==================================================\n","\n"," 검색 및 답변 생성 중...\n"," [질문]: 티빙 프리미엄 요금제 정가는 얼마야?\n","\n","==================================================\n","[답변]\n","티빙 프리미엄 \n"," 주요 요금제: 프리미엄 - 17,000원\n"," 관련 정책/내용: 제공된 정보에 따르면 티빙 프리미엄의 정가는 17,000원입니다. 다른 요금제인 148,000원은 티빙 프리미엄과 직접 관련된 정보인지 확인이 필요합니다.\n","==================================================\n","\n"," 검색 및 답변 생성 중...\n"]},{"name":"stderr","output_type":"stream","text":["Retrying neo4j_graphrag.utils.rate_limit.rate_limit_handler.<locals>.wrapper.<locals>.inner_func in 1.8323264033651583 seconds as it raised RateLimitError: Rate limit exceeded: Error code: 429 - {'error': {'message': 'Rate limit reached for model `llama-3.3-70b-versatile` in organization `org_01kc9ckaqven5vagd2w7y9ktm6` service tier `on_demand` on tokens per day (TPD): Limit 100000, Used 99934, Requested 1069. Please try again in 14m26.592s. Need more tokens? Upgrade to Dev Tier today at https://console.groq.com/settings/billing', 'type': 'tokens', 'code': 'rate_limit_exceeded'}}.\n","Retrying neo4j_graphrag.utils.rate_limit.rate_limit_handler.<locals>.wrapper.<locals>.inner_func in 1.1191618465908795 seconds as it raised RateLimitError: Rate limit exceeded: Error code: 429 - {'error': {'message': 'Rate limit reached for model `llama-3.3-70b-versatile` in organization `org_01kc9ckaqven5vagd2w7y9ktm6` service tier `on_demand` on tokens per day (TPD): Limit 100000, Used 99932, Requested 1069. Please try again in 14m24.864s. Need more tokens? Upgrade to Dev Tier today at https://console.groq.com/settings/billing', 'type': 'tokens', 'code': 'rate_limit_exceeded'}}.\n","Retrying neo4j_graphrag.utils.rate_limit.rate_limit_handler.<locals>.wrapper.<locals>.inner_func in 1.0615662778754291 seconds as it raised RateLimitError: Rate limit exceeded: Error code: 429 - {'error': {'message': 'Rate limit reached for model `llama-3.3-70b-versatile` in organization `org_01kc9ckaqven5vagd2w7y9ktm6` service tier `on_demand` on tokens per day (TPD): Limit 100000, Used 99930, Requested 269. Please try again in 2m51.936s. Need more tokens? Upgrade to Dev Tier today at https://console.groq.com/settings/billing', 'type': 'tokens', 'code': 'rate_limit_exceeded'}}.\n","Retrying neo4j_graphrag.utils.rate_limit.rate_limit_handler.<locals>.wrapper.<locals>.inner_func in 3.5586378617800025 seconds as it raised RateLimitError: Rate limit exceeded: Error code: 429 - {'error': {'message': 'Rate limit reached for model `llama-3.3-70b-versatile` in organization `org_01kc9ckaqven5vagd2w7y9ktm6` service tier `on_demand` on tokens per day (TPD): Limit 100000, Used 99928, Requested 269. Please try again in 2m50.208s. Need more tokens? Upgrade to Dev Tier today at https://console.groq.com/settings/billing', 'type': 'tokens', 'code': 'rate_limit_exceeded'}}.\n"]},{"name":"stdout","output_type":"stream","text":["\n","❌ 오류가 발생했습니다: RetryError[<Future at 0x27e0429b970 state=finished raised RateLimitError>]\n","\n","챗봇을 종료합니다.\n"]}],"source":["# GraphRAG 대화형 인터페이스\n","\n","print(\" 'exit', 'quit', 'q'를 입력하면 종료됩니다.\")\n","\n","while True:\n","    user_query = input(\"\\n[질문 입력]: \").strip()\n","\n","    if user_query.lower() in ['exit', 'quit', 'q']:\n","        print(\"\\n챗봇을 종료합니다.\")\n","        break\n","\n","    # 빈 입력 방지\n","    if not user_query:\n","        continue\n","\n","    print(\"\\n 검색 및 답변 생성 중...\")\n","\n","    try:\n","        result = graphrag.search(query_text=user_query, return_context=True)\n","\n","        print(f\" [질문]: {user_query}\")\n","        print(\"\\n\" + \"=\"*50)\n","        print(\"[답변]\")\n","        print(result.answer)\n","        print(\"=\"*50)\n","\n","\n","    except Exception as e:\n","        print(f\"\\n 오류가 발생했습니다: {e}\")"]},{"cell_type":"code","execution_count":null,"id":"4e6704b6","metadata":{"id":"4e6704b6"},"outputs":[],"source":["driver.close()"]}],"metadata":{"kernelspec":{"display_name":"test-rag","language":"python","name":"python3"},"language_info":{"codemirror_mode":{"name":"ipython","version":3},"file_extension":".py","mimetype":"text/x-python","name":"python","nbconvert_exporter":"python","pygments_lexer":"ipython3","version":"3.10.19"},"colab":{"provenance":[]},"widgets":{"application/vnd.jupyter.widget-state+json":{"5f36978f60fd4a11af083029b438439d":{"model_module":"@jupyter-widgets/controls","model_name":"HBoxModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HBoxModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HBoxView","box_style":"","children":["IPY_MODEL_3703af04824645b885fa4b8fb07cd5ef","IPY_MODEL_db7d1934913c47a69b3846c42ecd2bec","IPY_MODEL_8a2894b43ffe4f0d8000fe905eaeb80a"],"layout":"IPY_MODEL_f8acc84adc87411db36a1ad14c84f0c8"}},"3703af04824645b885fa4b8fb07cd5ef":{"model_module":"@jupyter-widgets/controls","model_name":"HTMLModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HTMLModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HTMLView","description":"","description_tooltip":null,"layout":"IPY_MODEL_605f9520ee764029b4265d0e201c1b55","placeholder":"​","style":"IPY_MODEL_499490676252433da08b3f3615419578","value":"modules.json: 100%"}},"db7d1934913c47a69b3846c42ecd2bec":{"model_module":"@jupyter-widgets/controls","model_name":"FloatProgressModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"FloatProgressModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"ProgressView","bar_style":"success","description":"","description_tooltip":null,"layout":"IPY_MODEL_fa1d4e6876b74ca79ad2bbdcbf174b28","max":229,"min":0,"orientation":"horizontal","style":"IPY_MODEL_ceea89d7172a42289ffcc7f994612e08","value":229}},"8a2894b43ffe4f0d8000fe905eaeb80a":{"model_module":"@jupyter-widgets/controls","model_name":"HTMLModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HTMLModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HTMLView","description":"","description_tooltip":null,"layout":"IPY_MODEL_bb1da623458b42d29ff61f0be8ca0700","placeholder":"​","style":"IPY_MODEL_27f20ec69af842308cfdf6f559af69aa","value":" 229/229 [00:00&lt;00:00, 18.5kB/s]"}},"f8acc84adc87411db36a1ad14c84f0c8":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"605f9520ee764029b4265d0e201c1b55":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"499490676252433da08b3f3615419578":{"model_module":"@jupyter-widgets/controls","model_name":"DescriptionStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"DescriptionStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","description_width":""}},"fa1d4e6876b74ca79ad2bbdcbf174b28":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"ceea89d7172a42289ffcc7f994612e08":{"model_module":"@jupyter-widgets/controls","model_name":"ProgressStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"ProgressStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","bar_color":null,"description_width":""}},"bb1da623458b42d29ff61f0be8ca0700":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"27f20ec69af842308cfdf6f559af69aa":{"model_module":"@jupyter-widgets/controls","model_name":"DescriptionStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"DescriptionStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","description_width":""}},"94ed3f5e3e144f99964de43f263a41f1":{"model_module":"@jupyter-widgets/controls","model_name":"HBoxModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HBoxModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HBoxView","box_style":"","children":["IPY_MODEL_c70cabcac5f643d48361a2730bae0e45","IPY_MODEL_1b76780897d94b77b11cab65a5e4ab92","IPY_MODEL_6a11735d059b4db4935a53dae40cd1a8"],"layout":"IPY_MODEL_1dad425f850448f6a1f7ba07ad808887"}},"c70cabcac5f643d48361a2730bae0e45":{"model_module":"@jupyter-widgets/controls","model_name":"HTMLModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HTMLModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HTMLView","description":"","description_tooltip":null,"layout":"IPY_MODEL_7b7639b5527f4e99b6407dd03905202c","placeholder":"​","style":"IPY_MODEL_68ff7c45d0f04256a4ac2c17203f54ad","value":"config_sentence_transformers.json: 100%"}},"1b76780897d94b77b11cab65a5e4ab92":{"model_module":"@jupyter-widgets/controls","model_name":"FloatProgressModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"FloatProgressModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"ProgressView","bar_style":"success","description":"","description_tooltip":null,"layout":"IPY_MODEL_e7f86afdd78b44a98eb2b82fc506a1b4","max":122,"min":0,"orientation":"horizontal","style":"IPY_MODEL_6f0b0b9997054950840993dd67a61c27","value":122}},"6a11735d059b4db4935a53dae40cd1a8":{"model_module":"@jupyter-widgets/controls","model_name":"HTMLModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HTMLModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HTMLView","description":"","description_tooltip":null,"layout":"IPY_MODEL_7a40b2c2d15042f6ae522c4947b0abe8","placeholder":"​","style":"IPY_MODEL_597c6fe4db4e4110906a3deb3a62449a","value":" 122/122 [00:00&lt;00:00, 11.4kB/s]"}},"1dad425f850448f6a1f7ba07ad808887":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"7b7639b5527f4e99b6407dd03905202c":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"68ff7c45d0f04256a4ac2c17203f54ad":{"model_module":"@jupyter-widgets/controls","model_name":"DescriptionStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"DescriptionStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","description_width":""}},"e7f86afdd78b44a98eb2b82fc506a1b4":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"6f0b0b9997054950840993dd67a61c27":{"model_module":"@jupyter-widgets/controls","model_name":"ProgressStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"ProgressStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","bar_color":null,"description_width":""}},"7a40b2c2d15042f6ae522c4947b0abe8":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"597c6fe4db4e4110906a3deb3a62449a":{"model_module":"@jupyter-widgets/controls","model_name":"DescriptionStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"DescriptionStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","description_width":""}},"146d5011222e47feae249c2f2291f187":{"model_module":"@jupyter-widgets/controls","model_name":"HBoxModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HBoxModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HBoxView","box_style":"","children":["IPY_MODEL_9167d2253aff4bdfbbb31dbcc3a27aac","IPY_MODEL_b6889da61ea344e393a925e5def12a3c","IPY_MODEL_8d7160f4c2ce48789f63b6aea0df3467"],"layout":"IPY_MODEL_f30e95beb9d242c1bad10b86a8820de4"}},"9167d2253aff4bdfbbb31dbcc3a27aac":{"model_module":"@jupyter-widgets/controls","model_name":"HTMLModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HTMLModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HTMLView","description":"","description_tooltip":null,"layout":"IPY_MODEL_c2bae80008094e39b62d067a652b4230","placeholder":"​","style":"IPY_MODEL_d3573ade69144bedbc335dc43152ebb5","value":"README.md: "}},"b6889da61ea344e393a925e5def12a3c":{"model_module":"@jupyter-widgets/controls","model_name":"FloatProgressModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"FloatProgressModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"ProgressView","bar_style":"success","description":"","description_tooltip":null,"layout":"IPY_MODEL_8cccb1274e254503b42345cb4d9fffc6","max":1,"min":0,"orientation":"horizontal","style":"IPY_MODEL_c56125f96cef4d7999945cc4f9eea923","value":1}},"8d7160f4c2ce48789f63b6aea0df3467":{"model_module":"@jupyter-widgets/controls","model_name":"HTMLModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HTMLModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HTMLView","description":"","description_tooltip":null,"layout":"IPY_MODEL_d85ec643b05248e8b575e3a9e796a0e5","placeholder":"​","style":"IPY_MODEL_618fe941862f4d7f8dabc689d5f4e542","value":" 3.89k/? [00:00&lt;00:00, 170kB/s]"}},"f30e95beb9d242c1bad10b86a8820de4":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"c2bae80008094e39b62d067a652b4230":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"d3573ade69144bedbc335dc43152ebb5":{"model_module":"@jupyter-widgets/controls","model_name":"DescriptionStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"DescriptionStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","description_width":""}},"8cccb1274e254503b42345cb4d9fffc6":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":"20px"}},"c56125f96cef4d7999945cc4f9eea923":{"model_module":"@jupyter-widgets/controls","model_name":"ProgressStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"ProgressStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","bar_color":null,"description_width":""}},"d85ec643b05248e8b575e3a9e796a0e5":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"618fe941862f4d7f8dabc689d5f4e542":{"model_module":"@jupyter-widgets/controls","model_name":"DescriptionStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"DescriptionStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","description_width":""}},"dc17732ccf734fdfa91fecd1fb078c2f":{"model_module":"@jupyter-widgets/controls","model_name":"HBoxModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HBoxModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HBoxView","box_style":"","children":["IPY_MODEL_f5174394e12b425e8aded06672996c9a","IPY_MODEL_c883d72632854a2a920b946cfe57442c","IPY_MODEL_8e4d0cd6e36d422d8260fa44d5f903f2"],"layout":"IPY_MODEL_1c2dd515f99f4ff89d8543c970962e36"}},"f5174394e12b425e8aded06672996c9a":{"model_module":"@jupyter-widgets/controls","model_name":"HTMLModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HTMLModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HTMLView","description":"","description_tooltip":null,"layout":"IPY_MODEL_2d87bb6f62454771a2ef139345ce978d","placeholder":"​","style":"IPY_MODEL_7af8cc04f37c465bad2a92dc2aa58cad","value":"sentence_bert_config.json: 100%"}},"c883d72632854a2a920b946cfe57442c":{"model_module":"@jupyter-widgets/controls","model_name":"FloatProgressModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"FloatProgressModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"ProgressView","bar_style":"success","description":"","description_tooltip":null,"layout":"IPY_MODEL_8dcd46c3879847529ddf08334a92a1ff","max":53,"min":0,"orientation":"horizontal","style":"IPY_MODEL_ced86be77e7b42989f35a424c6a401bf","value":53}},"8e4d0cd6e36d422d8260fa44d5f903f2":{"model_module":"@jupyter-widgets/controls","model_name":"HTMLModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HTMLModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HTMLView","description":"","description_tooltip":null,"layout":"IPY_MODEL_a627d75d4a3b417f9cac9344a93ab05c","placeholder":"​","style":"IPY_MODEL_3d7798a4a2864880a6f853d09526f1de","value":" 53.0/53.0 [00:00&lt;00:00, 2.02kB/s]"}},"1c2dd515f99f4ff89d8543c970962e36":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"2d87bb6f62454771a2ef139345ce978d":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"7af8cc04f37c465bad2a92dc2aa58cad":{"model_module":"@jupyter-widgets/controls","model_name":"DescriptionStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"DescriptionStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","description_width":""}},"8dcd46c3879847529ddf08334a92a1ff":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"ced86be77e7b42989f35a424c6a401bf":{"model_module":"@jupyter-widgets/controls","model_name":"ProgressStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"ProgressStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","bar_color":null,"description_width":""}},"a627d75d4a3b417f9cac9344a93ab05c":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"3d7798a4a2864880a6f853d09526f1de":{"model_module":"@jupyter-widgets/controls","model_name":"DescriptionStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"DescriptionStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","description_width":""}},"fb559477d50b4a76b3dcde635ec1f3dc":{"model_module":"@jupyter-widgets/controls","model_name":"HBoxModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HBoxModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HBoxView","box_style":"","children":["IPY_MODEL_bebb28d24e3f4c3faedca7edc145231b","IPY_MODEL_105bbd3a76914ab69ca5bc18b61a73ba","IPY_MODEL_42bd0cc9e6004d3187ebdf3f304988d4"],"layout":"IPY_MODEL_b2318f0e873d4f66b4837a08aa865a92"}},"bebb28d24e3f4c3faedca7edc145231b":{"model_module":"@jupyter-widgets/controls","model_name":"HTMLModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HTMLModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HTMLView","description":"","description_tooltip":null,"layout":"IPY_MODEL_629b0c5efd87487c9fd17f80256f3348","placeholder":"​","style":"IPY_MODEL_bc9af23769f34e7485c332df09d0551b","value":"config.json: 100%"}},"105bbd3a76914ab69ca5bc18b61a73ba":{"model_module":"@jupyter-widgets/controls","model_name":"FloatProgressModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"FloatProgressModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"ProgressView","bar_style":"success","description":"","description_tooltip":null,"layout":"IPY_MODEL_364bd04bcf03442ab151b59deeb139bb","max":645,"min":0,"orientation":"horizontal","style":"IPY_MODEL_99dbf0246bb548c58a775f40594594f1","value":645}},"42bd0cc9e6004d3187ebdf3f304988d4":{"model_module":"@jupyter-widgets/controls","model_name":"HTMLModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HTMLModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HTMLView","description":"","description_tooltip":null,"layout":"IPY_MODEL_75d2e6d0fb5c47eb8144e2f3266da342","placeholder":"​","style":"IPY_MODEL_2fa2e08e40db4d3a9a5f7a873914c604","value":" 645/645 [00:00&lt;00:00, 31.6kB/s]"}},"b2318f0e873d4f66b4837a08aa865a92":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"629b0c5efd87487c9fd17f80256f3348":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"bc9af23769f34e7485c332df09d0551b":{"model_module":"@jupyter-widgets/controls","model_name":"DescriptionStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"DescriptionStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","description_width":""}},"364bd04bcf03442ab151b59deeb139bb":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"99dbf0246bb548c58a775f40594594f1":{"model_module":"@jupyter-widgets/controls","model_name":"ProgressStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"ProgressStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","bar_color":null,"description_width":""}},"75d2e6d0fb5c47eb8144e2f3266da342":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"2fa2e08e40db4d3a9a5f7a873914c604":{"model_module":"@jupyter-widgets/controls","model_name":"DescriptionStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"DescriptionStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","description_width":""}},"3d80e03fdbee48a5a76de2213b0fef0e":{"model_module":"@jupyter-widgets/controls","model_name":"HBoxModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HBoxModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HBoxView","box_style":"","children":["IPY_MODEL_0230399de4ac4634add6f1ba8b6e5118","IPY_MODEL_088511416e0a4735864ccdb94c4ac354","IPY_MODEL_9f068b19292940f29b5fa9921beb19c9"],"layout":"IPY_MODEL_096ad08bc2f04aa9b9013430ae16f32d"}},"0230399de4ac4634add6f1ba8b6e5118":{"model_module":"@jupyter-widgets/controls","model_name":"HTMLModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HTMLModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HTMLView","description":"","description_tooltip":null,"layout":"IPY_MODEL_f35c2a67dbd54eebb240488d4ddfa7e6","placeholder":"​","style":"IPY_MODEL_906870f0d1534e4cb0859d6c5e5ad4d4","value":"model.safetensors: 100%"}},"088511416e0a4735864ccdb94c4ac354":{"model_module":"@jupyter-widgets/controls","model_name":"FloatProgressModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"FloatProgressModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"ProgressView","bar_style":"success","description":"","description_tooltip":null,"layout":"IPY_MODEL_0322582b292b41e1b4db5d539fcc1c1f","max":470641600,"min":0,"orientation":"horizontal","style":"IPY_MODEL_bd73849697654e70b0ccb85ac848e014","value":470641600}},"9f068b19292940f29b5fa9921beb19c9":{"model_module":"@jupyter-widgets/controls","model_name":"HTMLModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HTMLModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HTMLView","description":"","description_tooltip":null,"layout":"IPY_MODEL_f9beb23eff0f44ebb8dd150cc02e2481","placeholder":"​","style":"IPY_MODEL_42d7ce217c184ea69578a36ef04dc5b7","value":" 471M/471M [00:04&lt;00:00, 232MB/s]"}},"096ad08bc2f04aa9b9013430ae16f32d":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"f35c2a67dbd54eebb240488d4ddfa7e6":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"906870f0d1534e4cb0859d6c5e5ad4d4":{"model_module":"@jupyter-widgets/controls","model_name":"DescriptionStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"DescriptionStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","description_width":""}},"0322582b292b41e1b4db5d539fcc1c1f":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"bd73849697654e70b0ccb85ac848e014":{"model_module":"@jupyter-widgets/controls","model_name":"ProgressStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"ProgressStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","bar_color":null,"description_width":""}},"f9beb23eff0f44ebb8dd150cc02e2481":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"42d7ce217c184ea69578a36ef04dc5b7":{"model_module":"@jupyter-widgets/controls","model_name":"DescriptionStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"DescriptionStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","description_width":""}},"9882dbba0d2e4a8183dc47bb354af62f":{"model_module":"@jupyter-widgets/controls","model_name":"HBoxModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HBoxModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HBoxView","box_style":"","children":["IPY_MODEL_69d7a44c324e4e1289ed066acd439bc4","IPY_MODEL_8373870aef69464c9ff8e035b030ffb3","IPY_MODEL_872f469060d0491384e22962ef8614ed"],"layout":"IPY_MODEL_3c6db7f666164edb97d0e4a84ae8eec5"}},"69d7a44c324e4e1289ed066acd439bc4":{"model_module":"@jupyter-widgets/controls","model_name":"HTMLModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HTMLModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HTMLView","description":"","description_tooltip":null,"layout":"IPY_MODEL_89c1623e18034a8792a19bfeeb0ff3cf","placeholder":"​","style":"IPY_MODEL_58c7dc7db0d24242b060a4e1c7ab06d8","value":"tokenizer_config.json: 100%"}},"8373870aef69464c9ff8e035b030ffb3":{"model_module":"@jupyter-widgets/controls","model_name":"FloatProgressModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"FloatProgressModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"ProgressView","bar_style":"success","description":"","description_tooltip":null,"layout":"IPY_MODEL_d5d84933f4934425812276882c3cf8d1","max":480,"min":0,"orientation":"horizontal","style":"IPY_MODEL_68e74502b5444d37bd405dd33921b56a","value":480}},"872f469060d0491384e22962ef8614ed":{"model_module":"@jupyter-widgets/controls","model_name":"HTMLModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HTMLModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HTMLView","description":"","description_tooltip":null,"layout":"IPY_MODEL_d5dfd3cdd48b47a5b96b7657f46f1ca8","placeholder":"​","style":"IPY_MODEL_e550503253034836aa0957354f4d2424","value":" 480/480 [00:00&lt;00:00, 21.6kB/s]"}},"3c6db7f666164edb97d0e4a84ae8eec5":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"89c1623e18034a8792a19bfeeb0ff3cf":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"58c7dc7db0d24242b060a4e1c7ab06d8":{"model_module":"@jupyter-widgets/controls","model_name":"DescriptionStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"DescriptionStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","description_width":""}},"d5d84933f4934425812276882c3cf8d1":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"68e74502b5444d37bd405dd33921b56a":{"model_module":"@jupyter-widgets/controls","model_name":"ProgressStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"ProgressStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","bar_color":null,"description_width":""}},"d5dfd3cdd48b47a5b96b7657f46f1ca8":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"e550503253034836aa0957354f4d2424":{"model_module":"@jupyter-widgets/controls","model_name":"DescriptionStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"DescriptionStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","description_width":""}},"4ed511baf0624b628404849251f356be":{"model_module":"@jupyter-widgets/controls","model_name":"HBoxModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HBoxModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HBoxView","box_style":"","children":["IPY_MODEL_a6e6b8b9edc64c8f9661925267d17f08","IPY_MODEL_45573b6bb38d45a993909ff5ad67ac31","IPY_MODEL_b7748b8d1cc143a494327481770436ed"],"layout":"IPY_MODEL_6b7ffc638ba04d6aa0ba9875d0e0b2a8"}},"a6e6b8b9edc64c8f9661925267d17f08":{"model_module":"@jupyter-widgets/controls","model_name":"HTMLModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HTMLModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HTMLView","description":"","description_tooltip":null,"layout":"IPY_MODEL_9d77e1bddb6d4ce3a9fccf03693a945f","placeholder":"​","style":"IPY_MODEL_970fe8833f184a85bc9fd6ce9c796931","value":"tokenizer.json: 100%"}},"45573b6bb38d45a993909ff5ad67ac31":{"model_module":"@jupyter-widgets/controls","model_name":"FloatProgressModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"FloatProgressModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"ProgressView","bar_style":"success","description":"","description_tooltip":null,"layout":"IPY_MODEL_7784174fa91149358997b2e1869e334f","max":9081518,"min":0,"orientation":"horizontal","style":"IPY_MODEL_30add58ee6b54185a004998b214a18e1","value":9081518}},"b7748b8d1cc143a494327481770436ed":{"model_module":"@jupyter-widgets/controls","model_name":"HTMLModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HTMLModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HTMLView","description":"","description_tooltip":null,"layout":"IPY_MODEL_d6e6ba70711e4365af6795dbcc0844cf","placeholder":"​","style":"IPY_MODEL_6c3c4076bd9b443085bca09cfcd3191f","value":" 9.08M/9.08M [00:01&lt;00:00, 8.97MB/s]"}},"6b7ffc638ba04d6aa0ba9875d0e0b2a8":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"9d77e1bddb6d4ce3a9fccf03693a945f":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"970fe8833f184a85bc9fd6ce9c796931":{"model_module":"@jupyter-widgets/controls","model_name":"DescriptionStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"DescriptionStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","description_width":""}},"7784174fa91149358997b2e1869e334f":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"30add58ee6b54185a004998b214a18e1":{"model_module":"@jupyter-widgets/controls","model_name":"ProgressStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"ProgressStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","bar_color":null,"description_width":""}},"d6e6ba70711e4365af6795dbcc0844cf":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"6c3c4076bd9b443085bca09cfcd3191f":{"model_module":"@jupyter-widgets/controls","model_name":"DescriptionStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"DescriptionStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","description_width":""}},"219381f0ca86477a96e8f183ed802dc9":{"model_module":"@jupyter-widgets/controls","model_name":"HBoxModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HBoxModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HBoxView","box_style":"","children":["IPY_MODEL_5a54cf0954074e1f85d9a3a04b9e4dc5","IPY_MODEL_a8aabb82746049248c609ad01576ab14","IPY_MODEL_0640d1bebbfa4a2d9cb365c346da490c"],"layout":"IPY_MODEL_4f20070ab82e47c6bb3b886ae263370c"}},"5a54cf0954074e1f85d9a3a04b9e4dc5":{"model_module":"@jupyter-widgets/controls","model_name":"HTMLModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HTMLModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HTMLView","description":"","description_tooltip":null,"layout":"IPY_MODEL_16b72cebfa3348699aa683de9bfdb443","placeholder":"​","style":"IPY_MODEL_cb743d017100434bb42f0b5fd32f9cb8","value":"special_tokens_map.json: 100%"}},"a8aabb82746049248c609ad01576ab14":{"model_module":"@jupyter-widgets/controls","model_name":"FloatProgressModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"FloatProgressModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"ProgressView","bar_style":"success","description":"","description_tooltip":null,"layout":"IPY_MODEL_03b94a03094c4f15b6145b1f928ea994","max":239,"min":0,"orientation":"horizontal","style":"IPY_MODEL_fe5313769f1d491bbd1e084caddb694c","value":239}},"0640d1bebbfa4a2d9cb365c346da490c":{"model_module":"@jupyter-widgets/controls","model_name":"HTMLModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HTMLModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HTMLView","description":"","description_tooltip":null,"layout":"IPY_MODEL_7bb74a9a6c2742aeb0a3eddf639ad4d4","placeholder":"​","style":"IPY_MODEL_bfed9a76bd7f41548e87011165789648","value":" 239/239 [00:00&lt;00:00, 3.50kB/s]"}},"4f20070ab82e47c6bb3b886ae263370c":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"16b72cebfa3348699aa683de9bfdb443":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"cb743d017100434bb42f0b5fd32f9cb8":{"model_module":"@jupyter-widgets/controls","model_name":"DescriptionStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"DescriptionStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","description_width":""}},"03b94a03094c4f15b6145b1f928ea994":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"fe5313769f1d491bbd1e084caddb694c":{"model_module":"@jupyter-widgets/controls","model_name":"ProgressStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"ProgressStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","bar_color":null,"description_width":""}},"7bb74a9a6c2742aeb0a3eddf639ad4d4":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"bfed9a76bd7f41548e87011165789648":{"model_module":"@jupyter-widgets/controls","model_name":"DescriptionStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"DescriptionStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","description_width":""}},"9ba5c5495b874d29b31fcf2b9f8cd788":{"model_module":"@jupyter-widgets/controls","model_name":"HBoxModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HBoxModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HBoxView","box_style":"","children":["IPY_MODEL_485985a2cbd745dbb9bd883cafac6584","IPY_MODEL_8f66dfb2a92949b089708d8ba1d440d6","IPY_MODEL_e7e26d7976ca48e7a8e1ecd5399ed6c8"],"layout":"IPY_MODEL_7a1781f497d6443f9501bc17703106dc"}},"485985a2cbd745dbb9bd883cafac6584":{"model_module":"@jupyter-widgets/controls","model_name":"HTMLModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HTMLModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HTMLView","description":"","description_tooltip":null,"layout":"IPY_MODEL_86913d5f575648be85c358544520533e","placeholder":"​","style":"IPY_MODEL_9dec839c954d4738b364d9242399f7a4","value":"config.json: 100%"}},"8f66dfb2a92949b089708d8ba1d440d6":{"model_module":"@jupyter-widgets/controls","model_name":"FloatProgressModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"FloatProgressModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"ProgressView","bar_style":"success","description":"","description_tooltip":null,"layout":"IPY_MODEL_14dcd6ce57a8436eb5dd1647143b1f2a","max":190,"min":0,"orientation":"horizontal","style":"IPY_MODEL_146a8d046b004f5ca6e4010f13ad3951","value":190}},"e7e26d7976ca48e7a8e1ecd5399ed6c8":{"model_module":"@jupyter-widgets/controls","model_name":"HTMLModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HTMLModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HTMLView","description":"","description_tooltip":null,"layout":"IPY_MODEL_962fdbe04d954c17a5fa18ede3665045","placeholder":"​","style":"IPY_MODEL_ceb0d237c8b249b9a293031b9a7c86cc","value":" 190/190 [00:00&lt;00:00, 8.26kB/s]"}},"7a1781f497d6443f9501bc17703106dc":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"86913d5f575648be85c358544520533e":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"9dec839c954d4738b364d9242399f7a4":{"model_module":"@jupyter-widgets/controls","model_name":"DescriptionStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"DescriptionStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","description_width":""}},"14dcd6ce57a8436eb5dd1647143b1f2a":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"146a8d046b004f5ca6e4010f13ad3951":{"model_module":"@jupyter-widgets/controls","model_name":"ProgressStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"ProgressStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","bar_color":null,"description_width":""}},"962fdbe04d954c17a5fa18ede3665045":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"ceb0d237c8b249b9a293031b9a7c86cc":{"model_module":"@jupyter-widgets/controls","model_name":"DescriptionStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"DescriptionStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","description_width":""}}}}},"nbformat":4,"nbformat_minor":5}